# vim:ft=ruby

tap "homebrew/bundle"

### Packages ###

# A grep-like source code search tool
brew "ack"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# A solution for recording terminal sessions and sharing them on the web
brew "asciinema"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# A cat clone with syntax highlighting and Git integration
brew "bat"
# Improved top
brew "btop"
# CFSSL is CloudFlare's PKI/TLS swiss army knife
brew "cfssl"
# Install GNU core utilities (those that come with macOS are outdated)
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# A modern alternative for ls
brew "eza"
# A complete, cross-platform solution to record, convert and stream audio and video
brew "ffmpeg"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"
# A general-purpose command-line fuzzy finder
brew "fzf"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Git extension for managing large files
brew "git-lfs"
# A tool for detecting secrets like passwords, API keys, and tokens in git
brew "gitleaks"
# Install GNU `sed`, overwriting the built-in `sed`.
# Don't forget to add `$(brew --prefix gnu-sed)/libexec/gnubin` to `$PATH`
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Fast and multi-featured HTTP client
brew "hurl"
# A lightweight and flexible command-line JSON processor
brew "jq"
# Install some other useful utilities like `sponge`
brew "moreutils"
# Modern text editor
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs) locally
brew "ollama"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (required by some other tools)
brew "poppler"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Monitor data's progress through a pipe
brew "pv"
# A line-oriented search tool like grep and The Silver Searcher
brew "ripgrep"
# Fast Python linter, formatter, and type checker
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# A minimal, blazing-fast, and infinitely customizable prompt
brew "starship"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# To display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# The Z shell (latest)
brew "zsh"
# Additional completion definitions for `zsh`
brew "zsh-completions"
